Batch size 64, batch normalization:
0.97136664
Batch size 128, batch normalization, additional dense 64 dropout .2:
0.96905
CNN:
0.9825
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              multiple                  320
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320
_________________________________________________________________
flatten (Flatten)            multiple                  0
_________________________________________________________________
dense (Dense)                multiple                  802944
_________________________________________________________________
dropout (Dropout)            multiple                  0
_________________________________________________________________
dense_1 (Dense)              multiple                  8256
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0
_________________________________________________________________
batch_normalization (BatchNo multiple                  256
_________________________________________________________________
dense_2 (Dense)              multiple                  650
=================================================================
Total params: 832,106
Trainable params: 831,978
Non-trainable params: 128
After 10 epochs:
Training accuracy: 0.99416670.988
Test accuracy: 0.9880
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dense_1 (Dense)              multiple                  8256      
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
batch_normalization (BatchNo multiple                  256       
_________________________________________________________________
dense_2 (Dense)              multiple                  650       
=================================================================
Total params: 832,106
Trainable params: 831,978
Non-trainable params: 128
_________________________________________________________________
0.931333360.9756Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dense_1 (Dense)              multiple                  8256      
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
batch_normalization (BatchNo multiple                  256       
_________________________________________________________________
dense_2 (Dense)              multiple                  650       
=================================================================
Total params: 832,106
Trainable params: 831,978
Non-trainable params: 128
_________________________________________________________________
0.932933330.9829Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.95141670.8692Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.99493330.9856Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.0917968750.0709Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.952296850.9706Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.96568750.9712Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.993016660.986Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  320       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  8320      
_________________________________________________________________
batch_normalization_1 (Batch multiple                  512       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  802944    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
batch_normalization_2 (Batch multiple                  512       
_________________________________________________________________
dense_1 (Dense)              multiple                  1290      
=================================================================
Total params: 825,386
Trainable params: 824,810
Non-trainable params: 576
_________________________________________________________________
0.993645850.9852