{"config": {"layers": [{"config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "filters": 32, "dtype": "float32", "bias_regularizer": null, "padding": "same", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "filters": 32, "dtype": "float32", "bias_regularizer": null, "padding": "same", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_1", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization", "beta_regularizer": null, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 64, "dtype": "float32", "bias_regularizer": null, "padding": "same", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 128, "dtype": "float32", "bias_regularizer": null, "padding": "same", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_3", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_1", "beta_regularizer": null, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "dense", "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "dtype": "float32", "rate": 0.2, "name": "dropout", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "axis": [1], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_2", "beta_regularizer": null, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "units": 10, "dtype": "float32", "bias_regularizer": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "build_input_shape": [null, 28, 28, 1], "name": "sequential"}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}