{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential", "build_input_shape": [null, 28, 28, 1], "layers": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "name": "conv2d", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "filters": 32}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "name": "conv2d_1", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "padding": "same", "filters": 32}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null, "axis": [3]}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "name": "conv2d_2", "kernel_size": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "filters": 64}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "name": "conv2d_3", "kernel_size": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "padding": "same", "filters": 128}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null, "axis": [3]}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "name": "dense", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "units": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "dtype": "float32", "name": "dropout", "noise_shape": null, "rate": 0.2}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null, "axis": [1]}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "units": 10, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}]}, "keras_version": "2.2.4-tf"}